In [2]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [3]:
data = pd.read_csv('BP prediction.csv')

In [4]:
data

             Name  Age  Height  Weight  High BP%
0        John Doe   28     175      70        30
1      Jane Smith   34     160      60        35
2   Alice Johnson   23     168      58        20
3       Bob Brown   45     180      85        60
4      Mary Davis   29     155      50        25
5  Charlie Wilson   31     172      65        30
6     Emily Clark   22     165      54        15
7     James Lewis   37     178      77        55
8  Sarah Robinson   40     162      62        40
9   Michael Young   33     170      68        30

In [6]:
x = data.drop(columns=['Name','High BP%'])

In [7]:
y = data['High BP%']

In [8]:
x.shape

(10, 3)

In [9]:
y.shape

(10,)

In [11]:
x_train, x_test, y_train, y_test = train_test_split(x , y , random_state=11 , test_size=0.2)

In [12]:
x_train.shape

(8, 3)

In [13]:
x_test.shape

(2, 3)

In [14]:
x_train.describe()

             Age     Height     Weight
count   8.000000    8.00000   8.000000
mean   30.625000  168.12500  63.750000
std     7.229651    8.06115  10.964228
min    22.000000  155.00000  50.000000
25%    26.750000  163.75000  57.000000
50%    30.000000  169.00000  62.500000
75%    33.250000  172.75000  68.500000
max    45.000000  180.00000  85.000000

In [15]:
x_test.describe()

            Age      Height     Weight
count   2.00000    2.000000   2.000000
mean   38.50000  170.000000  69.500000
std     2.12132   11.313708  10.606602
min    37.00000  162.000000  62.000000
25%    37.75000  166.000000  65.750000
50%    38.50000  170.000000  69.500000
75%    39.25000  174.000000  73.250000
max    40.00000  178.000000  77.000000

In [ ]:
y_train.describe()